# PointFlexibleShowNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PointFlexibleShowNumber Property
ParameterTypeId Class See Also
---
"Show Placement Number"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PointFlexibleShowNumber { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PointFlexibleShowNumber As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PointFlexibleShowNumber {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace